var questions=[
	"你做事是一個值得信賴的人嗎？",
 	"你個性溫和嗎？",
	"你有活力嗎？",
	"你善解人意嗎？",
	"你獨立嗎？",
 	"你受人愛戴嗎？",
	"做事認真且正直嗎？",
	"你富有同情心嗎？",
	"你有說服力嗎？",
	"你大膽嗎？",
	"你精確嗎？",
	"你適應能力強嗎？",
	"你組織能力好嗎？",
	"你是否積極主動？",
	"你害羞嗎？",
	"你強勢嗎？",
	"你鎮定嗎？",
	"你勇於學習嗎？",
	"你反應快嗎？",
	"你外向嗎？",
	"你注意細節嗎？",
	"你愛說話嗎？",
	"你的協調能力好嗎？",
	"你勤勞嗎？",
	"你慷慨嗎？",
	"你小心翼翼嗎？",
	"你令人愉快嗎？",
	"你傳統嗎？",
	"你親切嗎？",
	"你工作足夠有效率嗎？"
]
var answers=[["5分",5],["4分",4],["3分",3],["2分",2],["1分",1]];

var selectedAnswer= new Array(30).fill(0);
var finalscores={
	"Tiger":0,
	"PeaCock":0,
	"Koala":0,
	"Owl":0,
	"Chameleon":0
}